[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/G7F3zRJ/book1.png",
    "review": "The Great Gatsby by F. Scott Fitzgerald stands out as a classic tale portraying themes of love, wealth, and the American Dream. Set in the Roaring Twenties, the novel captures the decadence and excesses of the Jazz Age while exploring the intricacies of relationships and societal expectations.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Romance"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/nDHNzGK/book2.png",
    "review": "To Kill a Mockingbird by Harper Lee offers a poignant narrative addressing racial injustice and moral growth in the Southern United States. Through the eyes of young Scout Finch, readers witness the profound impact of empathy, integrity, and courage in the face of prejudice and discrimination",
    "totalPages": 281,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Classic", "Social Issues"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "The Scholarship Monthly Planner",
    "author": "George Orwell",
    "image": "https://i.ibb.co/hfBrHgP/book6.png",
    "review": "The Scholarship by George Orwell presents a chilling portrayal of a dystopian society dominated by totalitarianism and surveillance. Orwell's prophetic vision of a future governed by thought control and propaganda continues to resonate with contemporary concerns about government overreach and privacy invasion.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J. D. Salinger",
    "image": "https://i.ibb.co/YNf3YNn/book4.png",
    "review": "The Catcher in the Rye by J. D. Salinger is a coming-of-age novel that delves into the disillusionment and alienation of adolescence. Through the rebellious journey of Holden Caulfield, the novel explores themes of identity, authenticity, and the search for meaning in a conformist society.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Novel",
    "tags": ["Coming-of-age", "Literary Fiction"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/sJkxTPy/book5.png",
    "review": "Pride and Prejudice by Jane Austen is a delightful comedy of manners that offers a satirical commentary on love, class, and societal norms in early 19th-century England. Austen's wit and keen observations elevate the novel into a timeless classic celebrated for its astute characterizations and sparkling dialogue.",
    "totalPages": 279,
    "rating": 4.8,
    "category": "Drama",
    "tags": ["Classic", "Romance"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J. R. R. Tolkien",
    "image": "https://i.ibb.co/tq82G62/book6.png",
    "review": "The Hobbit by J. R. R. Tolkien invites readers into the enchanting realm of Middle-earth through an epic adventure filled with magic, peril, and heroism. As Bilbo Baggins embarks on a quest to reclaim lost treasure from the dragon Smaug, Tolkien weaves a captivating tale of courage, friendship, and self-discovery.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Adventure", "Middle-earth"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  }
]
